In [69]:
import numpy as np
import pandas as pd

In [70]:
train = pd.read_csv('data/raw/train.csv')#.set_index('PassengerId')
test = pd.read_csv('data/raw/test.csv')#.set_index('PassengerId')

In [71]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [72]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# Sex

In [73]:
train.Sex = [1 if sex == 'male' else 0 for sex in train.Sex]
test.Sex = [1 if sex == 'male' else 0 for sex in test.Sex]

# Embarked

In [74]:
train_embarked = train.groupby(['PassengerId', 'Embarked']).size().unstack(fill_value = 0).drop(['S'], axis = 1)
test_embarked = test.groupby(['PassengerId', 'Embarked']).size().unstack(fill_value = 0).drop(['S'], axis = 1)

# Cabin

In [75]:
train['cabin'] = [str(x)[0].lower() for x in train.Cabin]
train_cabin = train.groupby(['PassengerId', 'cabin']).size().unstack(fill_value = 0).drop(['t'], axis = 1)

In [76]:
test['cabin'] = [str(x)[0].lower() for x in test.Cabin]
test_cabin = test.groupby(['PassengerId', 'cabin']).size().unstack(fill_value = 0)

# Combine

In [82]:
clean_train = train.drop(['Embarked', 'Name', 'Ticket', 'Cabin', 'cabin'], axis = 1).set_index('PassengerId').merge(train_embarked, left_index = True, right_index = True).merge(train_cabin, left_index = True, right_index = True)
clean_train.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,C,Q,a,b,c,d,e,f,g,n
PassengerId,,,,,,,,,,,,,,,,,
1,0,3,1,22.0,1,0,7.2500,0,0,0,0,0,0,0,0,0,1
2,1,1,0,38.0,1,0,71.2833,1,0,0,0,1,0,0,0,0,0
3,1,3,0,26.0,0,0,7.9250,0,0,0,0,0,0,0,0,0,1
4,1,1,0,35.0,1,0,53.1000,0,0,0,0,1,0,0,0,0,0
5,0,3,1,35.0,0,0,8.0500,0,0,0,0,0,0,0,0,0,1

In [87]:
clean_train.to_csv("data/clean/train.csv")

In [85]:
clean_test = test.drop(['Embarked', 'Name', 'Ticket', 'Cabin', 'cabin'], axis = 1).set_index('PassengerId').merge(test_embarked, left_index = True, right_index = True).merge(test_cabin, left_index = True, right_index = True)
clean_test.head()

,Pclass,Sex,Age,SibSp,Parch,Fare,C,Q,a,b,c,d,e,f,g,n
PassengerId,,,,,,,,,,,,,,,,
892,3,1,34.5,0,0,7.8292,0,1,0,0,0,0,0,0,0,1
893,3,0,47.0,1,0,7.0000,0,0,0,0,0,0,0,0,0,1
894,2,1,62.0,0,0,9.6875,0,1,0,0,0,0,0,0,0,1
895,3,1,27.0,0,0,8.6625,0,0,0,0,0,0,0,0,0,1
896,3,0,22.0,1,1,12.2875,0,0,0,0,0,0,0,0,0,1

In [88]:
clean_test.to_csv("data/clean/test.csv")